Tekla Open API Reference for Tekla Structures 2025
Polymesh.Fingerprint Method
 Gets fingerprint information for input brep
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string Fingerprint(
	FacetedBrep brep
)
Public Shared Function Fingerprint (
	brep As FacetedBrep
) As String
Parameters
brep
Type: Tekla.Structures.Geometry3d.FacetedBrep
The input parameter
Return Value
Type: String
Fingerprint of the brep in string format
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace